console.log("object"); //문자열 상수. 더블쿼테이션으로 묶여있는것은 문자열 
const pi = 3.14
console.log(3.14); //3.14 출력 - 실수형 상수
console.log(pi); //3.14 출력 - 변수 호출하기 

// pi = 5.14 //pi 변수에 대한 재정의하기는 불가능하다. // 주석으로 처리된 부분은 브라우저가 실행하지 않는다. 

console.log(pi); //콘솔창에 출력해줘

let msg ="안녕" //msg 변수를 호출하면 안녕
console.log(msg); //안녕이라고 출력됨

msg = "내일봐" // msg변수에 새로운 값으로 치환이 되었다. 
console.log(msg); // 내일봐가 출력됨 

// 하나의 변수에는 하나만 담을 수 있다. 
// log는 함수 이름이다. 
// log 괄호 안에는 파라미터가 올 수도 있다. 
// log 함수에 파라미터 자리에 변수 이름도 올 수 있다. 
// 변수를 호출하면 값이 출력된다. 
// log 함수의 소유주는 console이다. 